Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/edc/PIC32CM2532LE00100.PIC
      <edc:SFRDef ltx:memberofperipheral="TCC3" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="----nnnn----nnnnnnnnnnnnn-nnnnnn" edc:por="00000000000000000000000000000001" edc:mclr="00000000000000000000000000000001" edc:impl="0xF0FFFBF" edc:_addr="0x42003430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="STOP" edc:nzwidth="0x1" edc:desc="Stop"/>
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Ramp"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:nzwidth="0x1" edc:desc="Non-recoverable Update Fault State"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Debug Fault State"/>
            <edc:SFRFieldDef edc:cname="SLAVE" edc:nzwidth="0x1" edc:desc="Slave"/>
            <edc:SFRFieldDef edc:cname="PATTBUFV" edc:nzwidth="0x1" edc:desc="Pattern Buffer Valid"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERBUFV" edc:nzwidth="0x1" edc:desc="Period Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="FAULTAIN" edc:nzwidth="0x1" edc:desc="Recoverable Fault A Input"/>
            <edc:SFRFieldDef edc:cname="FAULTBIN" edc:nzwidth="0x1" edc:desc="Recoverable Fault B Input"/>
            <edc:SFRFieldDef edc:cname="FAULT0IN" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault0 Input"/>
            <edc:SFRFieldDef edc:cname="FAULT1IN" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault1 Input"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:nzwidth="0x1" edc:desc="Recoverable Fault A State"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:nzwidth="0x1" edc:desc="Recoverable Fault B State"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 0 State"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 1 State"/>
            <edc:SFRFieldDef edc:cname="CCBUFV0" edc:nzwidth="0x1" edc:desc="Compare Channel 0 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV1" edc:nzwidth="0x1" edc:desc="Compare Channel 1 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV2" edc:nzwidth="0x1" edc:desc="Compare Channel 2 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV3" edc:nzwidth="0x1" edc:desc="Compare Channel 3 Buffer Valid"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:nzwidth="0x1" edc:desc="Compare Channel 0 Value"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:nzwidth="0x1" edc:desc="Compare Channel 1 Value"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:nzwidth="0x1" edc:desc="Compare Channel 2 Value"/>
            <edc:SFRFieldDef edc:cname="CMP3" edc:nzwidth="0x1" edc:desc="Compare Channel 3 Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC3" edc:cname="COUNT" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42003434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x18" edc:desc="Counter Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x14" edc:desc="Counter Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x13" edc:desc="Counter Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x12" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC3" edc:cname="PATT" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x42003438">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="PGE0" edc:nzwidth="0x1" edc:desc="Pattern Generator 0 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PGE1" edc:nzwidth="0x1" edc:desc="Pattern Generator 1 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PGE2" edc:nzwidth="0x1" edc:desc="Pattern Generator 2 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PGE3" edc:nzwidth="0x1" edc:desc="Pattern Generator 3 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PGE4" edc:nzwidth="0x1" edc:desc="Pattern Generator 4 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PGE5" edc:nzwidth="0x1" edc:desc="Pattern Generator 5 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PGE6" edc:nzwidth="0x1" edc:desc="Pattern Generator 6 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PGE7" edc:nzwidth="0x1" edc:desc="Pattern Generator 7 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PGV0" edc:nzwidth="0x1" edc:desc="Pattern Generator 0 Output Value"/>
            <edc:SFRFieldDef edc:cname="PGV1" edc:nzwidth="0x1" edc:desc="Pattern Generator 1 Output Value"/>
            <edc:SFRFieldDef edc:cname="PGV2" edc:nzwidth="0x1" edc:desc="Pattern Generator 2 Output Value"/>
            <edc:SFRFieldDef edc:cname="PGV3" edc:nzwidth="0x1" edc:desc="Pattern Generator 3 Output Value"/>
            <edc:SFRFieldDef edc:cname="PGV4" edc:nzwidth="0x1" edc:desc="Pattern Generator 4 Output Value"/>
            <edc:SFRFieldDef edc:cname="PGV5" edc:nzwidth="0x1" edc:desc="Pattern Generator 5 Output Value"/>
            <edc:SFRFieldDef edc:cname="PGV6" edc:nzwidth="0x1" edc:desc="Pattern Generator 6 Output Value"/>
            <edc:SFRFieldDef edc:cname="PGV7" edc:nzwidth="0x1" edc:desc="Pattern Generator 7 Output Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200343A"/>
      <edc:SFRDef ltx:memberofperipheral="TCC3" edc:cname="WAVE" edc:nzwidth="0x20" edc:access="----nnnn----nnnn----nnnnnnnn-nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0F0FF7" edc:_addr="0x4200343C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:nzwidth="0x3" edc:desc="Waveform Generation">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:desc="Normal frequency" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:desc="Match frequency" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:desc="Normal PWM" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DPWM" edc:desc="Dual compare PWM" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DSCRITICAL" edc:desc="Dual-slope critical" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTTOM" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches ZERO" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTH" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DSTOP" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches TOP" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMP" edc:nzwidth="0x3" edc:desc="Ramp Mode">
              <edc:SFRFieldSemantic edc:cname="RAMP1" edc:desc="RAMP1 operation" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2A" edc:desc="Alternative RAMP2 operation" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2" edc:desc="RAMP2 operation" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2C" edc:desc="Critical RAMP2 operation" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2CS" edc:desc="Critical Swapped RAMP2 operation" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CIPEREN" edc:nzwidth="0x1" edc:desc="Circular period Enable"/>
            <edc:SFRFieldDef edc:cname="CICCEN0" edc:nzwidth="0x1" edc:desc="Circular Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CICCEN1" edc:nzwidth="0x1" edc:desc="Circular Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CICCEN2" edc:nzwidth="0x1" edc:desc="Circular Channel 2 Enable"/>
            <edc:SFRFieldDef edc:cname="CICCEN3" edc:nzwidth="0x1" edc:desc="Circular Channel 3 Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="POL0" edc:nzwidth="0x1" edc:desc="Channel 0 Polarity">
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL0" edc:desc="Single-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL1" edc:desc="Single-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL0" edc:desc="Dual-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL1" edc:desc="Dual-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL0" edc:desc="Dual Compare PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL1" edc:desc="Dual Compare PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POL1" edc:nzwidth="0x1" edc:desc="Channel 1 Polarity">
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL0" edc:desc="Single-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL1" edc:desc="Single-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL0" edc:desc="Dual-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL1" edc:desc="Dual-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL0" edc:desc="Dual Compare PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL1" edc:desc="Dual Compare PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POL2" edc:nzwidth="0x1" edc:desc="Channel 2 Polarity">
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL0" edc:desc="Single-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL1" edc:desc="Single-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL0" edc:desc="Dual-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL1" edc:desc="Dual-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL0" edc:desc="Dual Compare PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL1" edc:desc="Dual Compare PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POL3" edc:nzwidth="0x1" edc:desc="Channel 3 Polarity">
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL0" edc:desc="Single-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLESLOPEPOL1" edc:desc="Single-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL0" edc:desc="Dual-slope PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUALSLOPEPOL1" edc:desc="Dual-slope PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL0" edc:desc="Dual Compare PWM waveform generation Channel Polarity 0" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUALCOMPAREPOL1" edc:desc="Dual Compare PWM waveform generation Channel Polarity 1" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SWAP0" edc:nzwidth="0x1" edc:desc="Swap DTI Output Pair 0"/>
            <edc:SFRFieldDef edc:cname="SWAP1" edc:nzwidth="0x1" edc:desc="Swap DTI Output Pair 1"/>
            <edc:SFRFieldDef edc:cname="SWAP2" edc:nzwidth="0x1" edc:desc="Swap DTI Output Pair 2"/>
            <edc:SFRFieldDef edc:cname="SWAP3" edc:nzwidth="0x1" edc:desc="Swap DTI Output Pair 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC3" edc:cname="PER" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:impl="0xFFFFFF" edc:_addr="0x42003440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x18" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x14" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x13" edc:desc="Period Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x12" edc:desc="Period Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC3" edc:cname="CC0" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42003444">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC3">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
