Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/edc/PIC32CM2532LE00100.PIC
      <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OPAMPCTRL1" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFE" edc:_addr="0x42005008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Operational Amplifier Enable"/>
            <edc:SFRFieldDef edc:cname="ANAOUT" edc:nzwidth="0x1" edc:desc="Analog Output"/>
            <edc:SFRFieldDef edc:cname="BIAS" edc:nzwidth="0x2" edc:desc="Bias Selection">
              <edc:SFRFieldSemantic edc:cname="MODE0" edc:desc="Minimum current consumption, but the slowest mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Low current consumption, slow speed" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="High current consumption, fast speed" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Maximum current consumption, but the fastest mode" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RES2VCC" edc:nzwidth="0x1" edc:desc="Resistor ladder To VCC"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="RES2OUT" edc:nzwidth="0x1" edc:desc="Resistor ladder To Output"/>
            <edc:SFRFieldDef edc:cname="RES1EN" edc:nzwidth="0x1" edc:desc="Resistor 1 Enable"/>
            <edc:SFRFieldDef edc:cname="RES1MUX" edc:nzwidth="0x3" edc:desc="Resistor 1 Mux">
              <edc:SFRFieldSemantic edc:cname="OA1POS" edc:desc="OPAMP1 Positive Input" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OA1NEG" edc:desc="OPAMP1 Negative Input" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 Output" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="AVSS" edc:desc="Ground" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="RG_CONN" edc:desc="RG_CONN" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POTMUX" edc:nzwidth="0x3" edc:desc="Potentiometer Selection">
              <edc:SFRFieldSemantic edc:cname="14R_2R" edc:desc="R1 = 14R, R2 = 2R" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="12R_4R" edc:desc="R1 = 12R, R2 = 4R" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="8R_8R" edc:desc="R1 = 8R, R2 = 8R" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="6R_10R" edc:desc="R1 = 6R, R2 = 10R" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="4R_12R" edc:desc="R1 = 4R, R2 = 12R" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="3R_13R" edc:desc="R1 = 3R, R2 = 13R" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="2R_14R" edc:desc="R1 = 2R, R2 = 14R" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="R_15R" edc:desc="R1 = 1R, R2 = 15R" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x4" edc:desc="Positive Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="OA1POS" edc:desc="OPAMP1 Positive Input" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OA1TAP" edc:desc="OPAMP1 Resistor ladder taps" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DAC_REFBUF" edc:desc="REFERENCE or DAC VOUT0 Output" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="AVSS" edc:desc="Ground" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 output" edc:when="(field &amp; 0xF) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x4" edc:desc="Negative Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="OA0NEG" edc:desc="OPAMP0 Negative Input" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="OPAMP0 Resistor ladder taps" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DAC_REFBUF" edc:desc="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 Output" edc:when="(field &amp; 0xF) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OPAMPCTRL2" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFE" edc:_addr="0x4200500C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Operational Amplifier Enable"/>
            <edc:SFRFieldDef edc:cname="ANAOUT" edc:nzwidth="0x1" edc:desc="Analog Output"/>
            <edc:SFRFieldDef edc:cname="BIAS" edc:nzwidth="0x2" edc:desc="Bias Selection">
              <edc:SFRFieldSemantic edc:cname="MODE0" edc:desc="Minimum current consumption, but the slowest mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Low current consumption, slow speed" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="High current consumption, fast speed" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Maximum current consumption, but the fastest mode" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RES2VCC" edc:nzwidth="0x1" edc:desc="Resistor ladder To VCC"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="RES2OUT" edc:nzwidth="0x1" edc:desc="Resistor ladder To Output"/>
            <edc:SFRFieldDef edc:cname="RES1EN" edc:nzwidth="0x1" edc:desc="Resistor 1 Enable"/>
            <edc:SFRFieldDef edc:cname="RES1MUX" edc:nzwidth="0x3" edc:desc="Resistor 1 Mux">
              <edc:SFRFieldSemantic edc:cname="OA2POS" edc:desc="OPAMP2 Positive Input" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OA2NEG" edc:desc="OPAMP2 Negative Input" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OA1OUT" edc:desc="OPAMP1 Output" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="AVSS" edc:desc="Ground" edc:when="(field &amp; 0x7) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POTMUX" edc:nzwidth="0x3" edc:desc="Potentiometer Selection">
              <edc:SFRFieldSemantic edc:cname="14R_2R" edc:desc="R1 = 14R, R2 = 2R" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="12R_4R" edc:desc="R1 = 12R, R2 = 4R" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="8R_8R" edc:desc="R1 = 8R, R2 = 8R" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="6R_10R" edc:desc="R1 = 6R, R2 = 10R" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="4R_12R" edc:desc="R1 = 4R, R2 = 12R" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="3R_13R" edc:desc="R1 = 3R, R2 = 13R" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="2R_14R" edc:desc="R1 = 2R, R2 = 14R" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="R_15R" edc:desc="R1 = 1R, R2 = 15R" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x4" edc:desc="Positive Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="OA2POS" edc:desc="OPAMP2 Positive Input" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OA2TAP" edc:desc="OPAMP2 Resistor ladder taps" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DAC_REFBUF" edc:desc="REFERENCE or DAC VOUT0 Output" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="AVSS" edc:desc="Ground" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="OA1OUT" edc:desc="OPAMP1 Output" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="OA0POS" edc:desc="OPAMP0 Positive Input" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="OA1POS" edc:desc="OPAMP1 Positive Input" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="OPAMP0 Resistor Ladder Taps" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="RES3TAP" edc:desc="RES3TAP Potentiometer" edc:when="(field &amp; 0xF) == 0x08"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x4" edc:desc="Negative Input Mux Selection">
              <edc:SFRFieldSemantic edc:cname="OA0NEG" edc:desc="OPAMP0 Negative Input" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OA0TAP" edc:desc="OPAMP0 Resistor ladder taps" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DAC_REFBUF" edc:desc="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OA0OUT" edc:desc="OPAMP0 Output" edc:when="(field &amp; 0xF) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="RESCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x42005010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
            <edc:SFRFieldDef edc:cname="RES2OUT" edc:nzwidth="0x1" edc:desc="Resistor ladder To Output"/>
            <edc:SFRFieldDef edc:cname="RES1EN" edc:nzwidth="0x1" edc:desc="Resistor 1 Enable"/>
            <edc:SFRFieldDef edc:cname="RES1MUX" edc:nzwidth="0x1" edc:desc="Resistor 1 Mux">
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC VOUT0 Output" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFBUF" edc:desc="OPAMP Reference Buffer Output" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POTMUX" edc:nzwidth="0x3" edc:desc="Potentiometer Selection">
              <edc:SFRFieldSemantic edc:cname="14R_2R" edc:desc="Gain = 0.14" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="12R_4R" edc:desc="Gain = 0.33" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="8R_8R" edc:desc="Gain = 1" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="6R_10R" edc:desc="Gain = 1.67" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="4R_12R" edc:desc="Gain = 3" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="3R_13R" edc:desc="Gain = 4.33" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="2R_14R" edc:desc="Gain = 7" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="R_15R" edc:desc="Gain = 15" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REFBUFLEVEL" edc:nzwidth="0x2" edc:desc="Reference output voltage level select">
              <edc:SFRFieldSemantic edc:cname="1_1V" edc:desc="1.1V" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1_25V" edc:desc="1.25V" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="1_6V" edc:desc="1.6V" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3EF" edc:_addr="0x42005011"/>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="nn-n--nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD3" edc:_addr="0x42005400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TAMPERS" edc:nzwidth="0x1" edc:desc="Tamper Erase"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:nzwidth="0x1" edc:desc="Data Remanence Prevention"/>
            <edc:SFRFieldDef edc:cname="SILACC" edc:nzwidth="0x1" edc:desc="Silent Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42005401"/>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42005404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="TrustRAM Readout Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:nzwidth="0x1" edc:desc="Data Remanence Prevention Ended Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42005405">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="TrustRAM Readout Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:nzwidth="0x1" edc:desc="Data Remanence Prevention Ended Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42005406">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="TrustRAM Readout Error"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:nzwidth="0x1" edc:desc="Data Remanence Prevention Ended"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="------rr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42005407">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="RAMINV" edc:nzwidth="0x1" edc:desc="RAM Inversion Bit"/>
            <edc:SFRFieldDef edc:cname="DRP" edc:nzwidth="0x1" edc:desc="Data Remanence Prevention Ongoing"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x42005408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="DSCC" edc:nzwidth="0x20" edc:access="w-wwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xBFFFFFFF" edc:_addr="0x4200540C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DSCKEY" edc:nzwidth="0x1E" edc:desc="Data Scramble Key"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSCEN" edc:nzwidth="0x1" edc:desc="Data Scramble Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1F0" edc:_addr="0x42005410"/>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005604">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
